CREATE DATABASE  IF NOT EXISTS `ShanShan` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `ShanShan`;
-- MySQL dump 10.13  Distrib 8.0.22, for macos10.15 (x86_64)
--
-- Host: localhost    Database: ShanShan
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `article`
--

DROP TABLE IF EXISTS `article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `article` (
  `article_id` int NOT NULL AUTO_INCREMENT COMMENT '文章編號',
  `member_id` int NOT NULL COMMENT '會員編號',
  `mountain_id` int DEFAULT NULL COMMENT '山編號',
  `article_title` varchar(45) NOT NULL COMMENT '文章名稱',
  `article_content` varchar(300) NOT NULL COMMENT '文章內容',
  `article_date_created` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '文章發表日期',
  `event_date` date NOT NULL COMMENT '登山日期',
  `recommendation` int NOT NULL COMMENT '推薦',
  `article_points_recieved` int NOT NULL DEFAULT '0' COMMENT '文章打賞數',
  `article_status` tinyint NOT NULL DEFAULT '1' COMMENT '文章狀態',
  `aritcle_viewer` int DEFAULT '0' COMMENT '文章觀看數',
  `other_mtn` varchar(45) DEFAULT NULL COMMENT '其他山名',
  PRIMARY KEY (`article_id`),
  KEY `FK_article_member_id_idx` (`member_id`),
  KEY `FK_article_mountain_id_idx` (`mountain_id`),
  CONSTRAINT `FK_article_member_id` FOREIGN KEY (`member_id`) REFERENCES `member` (`member_id`),
  CONSTRAINT `FK_article_mountain_id` FOREIGN KEY (`mountain_id`) REFERENCES `mountain` (`mountain_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2026 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article`
--

LOCK TABLES `article` WRITE;
/*!40000 ALTER TABLE `article` DISABLE KEYS */;
INSERT INTO `article` VALUES (2001,1,1,'[大霸群峰] 霸氣爬山趣','感謝團長申豪開團，與隊友的陪伴，我們由大鹿林道東線步道進入，經馬達拉溪登山口、九九山莊宿營可達加利山（百岳86）、伊澤山（百岳53）、大霸尖山（百岳28）及小霸尖山（百岳36），也感謝老天爺賞賜好天氣，讓我們順利完成四座百岳。','2021-11-15 16:01:14','2021-07-11',5,0,1,558,NULL),(2002,5,1,'大霸尖山意外之行','會去走大壩群峰，純粹就是一個意料之外的事情（不然就去走武陵四秀了，會死更慘），而且剛好跟到一群高手的團，我的節奏完全就是拖累團隊的節奏，但也慶幸有一群高手相伴，有他們的鼓勵，也讓我走到最後沒有放棄。','2021-11-15 16:26:02','2021-05-01',4,0,1,598,NULL),(2003,9,1,'大霸群峰三天兩夜。此生必訪的世紀奇峰-大霸尖山','大霸群峰（包含大霸尖山、小霸尖山、伊澤山與加利山）。其中知名的大霸尖山，素有「世紀奇峰」之美稱，也是「台灣三尖」其中一座。大霸尖山與旁邊的小霸尖山遠看像一個耳朵，也被台灣泰雅族與賽夏族原住民視為聖山，原住民認為族人們需要打開自己的耳朵去聆聽身邊以及山林的聲音來做事，有深層的意義存在。','2021-11-15 16:26:02','2021-08-25',4,0,1,343,NULL),(2004,8,4,'【小百岳】台北‧陽明山-七星山主峰及七星山東峰','小油坑路線假日人潮多，安全性很高，路幾乎都是直線，所以沒有迷路的困擾，整條路都是石階，陽明山山上氣候變化大，前一秒可能是好天氣後一秒可能就起霧了，到了主峰也可能霧茫茫一片，看不到遠景，還有很多人沒運動習慣的雖到主峰1.6KM ，很多在半路就被抖上的階梯逼到腿軟了，請大家還是要注意，再怎麼說來回也要2~3小時的時間，如果能帶登山杖會比較好，可以分散一些膝蓋負擔，總之裝備和基本補給要備妥再登山喔!','2021-11-15 17:23:39','2020-07-01',4,0,1,130,NULL),(2005,4,6,'「台灣第二高峰」絕美雪山主東行程','台灣第二高峰「雪山」，我卻拖了很久才終於來雪山主峰＋東峰這條經典路線，但實際走過，也是我近年來爬山覺得景色非常美的一趟行程，圈谷的壯闊、黑森林光影流動，還有山谷草原的柔美靜謐，翻新過後的七卡山莊更是好到很想長住下來','2021-11-15 17:23:39','2021-04-16',5,0,1,785,NULL),(2006,7,6,'雪山主東峰','朦朧的圈谷..神秘的黑森林..即使登頂遇白牆..還是值得一來再來','2021-11-15 17:30:36','2021-07-23',3,0,1,179,NULL),(2007,2,6,'雪山東峰一日行','山的美怎麼拍的好看，在陽光下更是如此。雖然走之字路上坡喘的要命，雖然要通過走到快要哭的『哭坡』，但一切都值得。到了東峰，坐在高山草原上，遠望著369山莊、高聳的雪山山脈，這壯闊的景色再好的攝影器材也無法容納，唯有親自走一趟，用雙眼才能體會','2021-11-15 17:32:24','2021-06-05',4,0,1,222,NULL),(2008,3,18,'【合歡山北峰】挑戰合歡最高峰！台灣入門百岳','南投景點登山健行，合歡山北峰。在今年完成我的首座台灣百岳，北合歡山海拔高度3,422公尺，為合歡群峰當中最高峰。步道長度2.3K約2個半小時能抵達三角點，從起登就能感受到遼闊美景，沿途無需攀爬且步道算滿好走的，是相當適合登山新手的入門百岳。','2021-11-19 13:15:19','2021-05-08',5,0,1,432,NULL),(2009,5,18,'南投景點｜合歡北峰3422公尺～合歡山百岳攻頂全記錄！','百岳合歡北峰標高3422公尺，步道陡峭，往返距離約4,7km，需時4小時的路程，這次帶領朋友們挑戰百岳-合歡北峰，話說一看到是艱難的行程，人數馬上遞減成9個人，哈..開玩笑的！每次來到合歡山絕對不會滿足於合歡公路的壯麗景觀而已，一定要爬座山岳來活動筋骨，合歡主峰、合歡東峰、合歡北峰、石門山、合歡尖山，歷經艱辛的過程，攻頂後才是微笑台灣深度旅遊的開端','2021-11-19 13:15:19','2021-10-01',4,0,1,156,NULL),(2010,6,NULL,'【合歡群峰】石門山','石門山是合歡群峰中最容易攀登的台灣百岳，也是台灣百岳中最平易近人的高山，從登山口出發沿著步道，通常約30分鐘的時間就可登頂，適合百岳新手和全家大小一起來走訪，只要短短的時間就能獲得相當美麗的風景！','2021-11-19 13:22:21','2021-07-26',4,0,1,89,'石門山'),(2011,6,18,'【合歡群峰】合歡東峰','合歡東峰是合歡群峰的第二高峰，步道全長1.1公里，登山口位於松雪樓旁，從登山口到峰頂落差約三百公尺，沿途皆有木階可踩踏，步道設置完善安全，通常約2小時就可登頂。合歡山東峰山勢被列為百岳九峨之一，每逢5、6月間，還能在合歡東峰步道看見玉山杜鵑的蹤影，曾經合歡山這裡有滑雪訓練場，就位在坡度較為平緩的合歡東峰東側，因此步道沿途還能見到廢棄的纜車站喔！','2021-11-19 13:22:21','2021-07-26',5,0,1,245,NULL),(2012,6,18,'【合歡群峰】合歡主峰','合歡主峰的視野寬廣無比，站在山頂可一望合歡群峰、奇萊連峰、能高山、南湖大山、中央尖山等一覽無遺，步道單程為1.8公里，步道設置相當完善，水泥路居多，一路平緩好走，高度落差僅230公尺，通常花費1～2小時即可登頂！','2021-11-19 13:22:21','2021-07-26',5,0,1,337,NULL),(2013,10,17,'奇萊主北邂逅魔幻水鹿','去年爬了兩座入門款的奇萊南華，今年決定挑戰B級的奇萊主北，可以欣賞優美的奇萊稜線，登上險峻懾人的奇萊主山和奇萊北峰，其中，奇萊北峰更是百岳中的一奇，也是十俊之一。幸運邂逅超難忘的雲海，主山看見充滿生命力的台灣水鹿，絕對是一段精采絕倫又難忘的登山體驗','2021-11-19 13:35:07','2021-09-05',5,0,1,999,NULL),(2014,2,17,'兩天一夜奇萊主北','Day1抵達稜線山屋後，殺去主山看夕陽摸黑回山屋，隔天登北峰再下山，Day2慢條斯理走走拍拍，爬起愜意不少，簡單來說，對腳力沒信心可以安排三天兩夜，尤其回登山口的最後3.7K是上坡，疲勞時可能會爬到崩潰，但Day1和Day3大概只爬半天。對腳力有些信心，兩天一夜沒什麼問題，Day1若能先撿一顆，Day2會輕鬆不少，但最後3.7K上坡真的厭世QQ','2021-11-19 13:35:07','2021-09-18',4,0,1,31,NULL),(2015,1,16,'極東百岳—馬比杉山','「馬比杉山」由於路途相當遙遠，有如玉山群峰中的鹿山一樣，只因為名列高山百岳之一，所以明知前途艱辛難行，儘管山路崎嶇迢遙，卻是許多有意完登百岳者不得不走的行程。聽說曾經有人走南湖群峰錯過了馬比杉山，後來為了要完成百岳，不得不再花四到五天的時間，專程來走一趟。所以不管將來是否有機會完登百岳，既然來到南湖，馬比杉山是肯定要去的。','2021-11-19 13:47:33','2021-08-19',3,0,1,157,NULL),(2016,3,16,'馬比杉山','站在馬比杉山大草原的山頭上，環視這些氣宇非凡的山峰，一股對山的戀念情懷，襲上心頭，撩起了愛山人最原始的渴望，期盼有一天能馳騁在這片豪壯的山稜上','2021-11-19 13:52:55','2021-07-01',3,0,1,11,NULL),(2017,4,16,'遠得要命馬比杉山','路線行程：南湖山屋→南湖東峰（Ｈ３６３２Ｍ）→陶賽峰（從山腳下路過）→南湖東南峰（Ｈ３４６２Ｍ）→叉路口→馬比杉山（Ｈ３２１１Ｍ）→石洞獵寮→優美谷地→南湖山屋','2021-11-19 13:55:40','2021-09-17',4,0,1,561,NULL),(2018,11,22,'蛇頭山','美杜莎（拉丁語：Medusa，又翻譯為梅杜莎、墨杜薩），是希臘神話中的一個女妖，戈爾貢三姊妹之一。一般形象為一雙蝙蝠翼的蛇髮女人。她的父親是佛西士，母親則為海妖克不過希吉努斯則提了另外一種說法，指出三姊妹其實是堤豐和艾奇娜的孩子。','2021-11-19 14:05:07','2021-10-07',1,0,1,19,NULL),(2019,12,22,'蛇頭山','手機即可操作/日賺3000UP/月領100K/每日工作20分鐘/為自己加薪，詳情見連結http://xxx.xxx.xxx','2021-11-19 15:08:31','2021-11-19',1,0,0,1,NULL),(2020,4,13,'白姑大山三天兩夜','由於白姑大山路線有許多困難地形，一日單攻山友花10至20小時的人都有，此次跟同行夥伴兩人前晚睡眠時間不足，來回含休息大約花14.5小時，會建議要安排單攻的人除了事前的體能訓練、帶齊裝備之外，也記得要睡飽一點…。','2021-11-19 15:17:40','2021-06-06',2,0,1,78,NULL),(2021,7,13,'單攻白姑大山','白姑大山單攻非常累人，尤其是吉他營地之後的上坡路段，挑戰極高，雖然沒有危險的斷崖或是碎石坡地形，不過因為坡度陡，加上有倒木、箭竹、岩壁、樹根與石瀑地形，若心肺、肌耐力、體能、速度沒有一定水平，來此必爆！另外，同行夥伴也需要篩選能力，像這次在山頂遇上一組山友，團員速度落差至少1小時，若碰到落單的話，風險程度相當高。分享給大家囉～！','2021-11-19 15:21:22','2021-05-21',2,0,1,98,NULL),(2022,8,1,'世紀奇峰大霸尖山','有著「世紀奇峰」美名的大霸尖山，座落在500元鈔票背後，沿途還可順道造訪小霸尖山、伊澤山、加利山，四座百岳合稱大霸群峰。','2021-11-19 15:25:10','2021-03-29',5,0,1,363,NULL),(2023,7,1,'百岳登山-大霸尖山','大霸尖山登山路線每天都需要步行約20公里，是相當耗體能的一條路線，若非平常已有固定運動習慣或是時常上山走走的朋友，可別輕易嘗試，至於中間會行走的困難地形，只要謹慎注意踩點即可，無需太擔心，唯大霸基底的路段若遇上結冰，也要有撤退的勇氣，切勿貿然前進，不然滑落山谷可就糗了! 扣除難度這件事情，沿途景色優美，又能完成大霸群峰四座百岳，CP值還蠻高的，推薦給大家','2021-11-19 15:28:23','2021-05-05',5,0,1,647,NULL),(2024,8,6,'雪山主峰、雪山東峰兩天一夜看日出','人生中第一座過夜的百岳，就獻給了雪山主峰！相信許多跟我一樣的登山新手，出發前心裡難免感到些微不安，但經過了這趟難忘的雪山兩天一夜之旅，我覺得其實雪山主峰並沒有想像中那麼難親近，所以想寫篇「勸敗文」，與大家分享雪山主峰、東峰新手攀登的經驗、行程安排建議，希望大家都能勇於跨出一步，一起邁向人生中的下一座百岳！','2021-11-19 15:31:59','2021-02-25',4,0,1,756,NULL),(2025,1,4,'陽明山七星連走','七星連走是岳界前輩蕭郎為慶祝旅聯網七週年而設計的行程，由小油坑出發，連走七星山七個七開頭的景點，分別為：七星瀑布、七星公園、七星東峰、七星主峰、七星錐、七星南峰、七星池，是陽明山健行路線中，頗具創意的行程。其中七星池只有在颱風大雨後才會出現，可說是忽隱忽現的神秘之湖。','2021-11-19 15:59:03','2021-07-15',4,0,1,364,NULL);
/*!40000 ALTER TABLE `article` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-11-21  0:30:17
